<?php

/**
 * 朗读评分计算项目配置
 */
return array(

    /**
     * 朗读分数评测各项权重配置
     */
    'w' => array(

        'pronunciation' => 0.2, // 发音

        'intonation'    => 0.2, // 语调

        'stress'        => 0.2, // 重音

        'fluency'       => 0.2, // 流畅

        'speed'         => 0.2  // 语速

    ),

    /**
     * 语速（每分钟单词数）得到100分的上限和下限
     */
    'speed' => array(

        'low' => 60, // 默认，一般从课文原文分析报告中获取

        'high' => 120,

        'level' => 2 // 扣 1 分的单词数：如标准音语速80，那么读到78个词则扣 1 分，读到76个词则扣 2 分...

    )
);
